In [4]:
import pandas as pd

In [20]:
df = pd.read_csv('./Data//zipcode_database.csv')

In [21]:
df[df.Zipcode == 94901]

,Zipcode,ZipCodeType,City,State,LocationType,Lat,Long,Location,Decommisioned,TaxReturnsFiled,EstimatedPopulation,TotalWages
23635,94901,STANDARD,SAN RAFAEL,CA,PRIMARY,37.97,-122.5,NA-US-CA-SAN RAFAEL,False,21498.0,33561.0,1.034325e+09

In [22]:
df.ZipCodeType.value_counts()

STANDARD    29971
PO BOX       9465
UNIQUE       2437
MILITARY      649
Name: ZipCodeType, dtype: int64

In [25]:
df.shape

(42522, 12)

In [36]:
df_2 = pd.read_excel('./Data/County_industries_2012-2015.xlsx')

In [45]:
df_2.head(7)

,FIPS,Countyname,Postal,LineCode,IndustryName,Gross domestic product (GDP) by county,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,NaN,NaN,NaN,NaN,NaN,(thousands of dollars),NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,2012,2013,2014,2015
2,01001,Autauga,AL,1.0,All Industries,1383941,1363368,1402516,1539406
3,01001,Autauga,AL,2.0,Private goods-producing industries,286396,310468,323582,346355
4,01001,Autauga,AL,3.0,Private services-providing industries,948490,904599,928438,1037309
5,01001,Autauga,AL,4.0,Government and government enterprises,149055,148301,150496,155742
6,01003,Baldwin,AL,1.0,All Industries,5599194,6365080,6547396,6436107

In [35]:
len(list(df_2.Postal.value_counts().index))

51

In [33]:
len(list(df_2.Countyname.value_counts().index))

1833

In [27]:
df_2.shape

(12458, 9)

In [38]:
df_3 = pd.read_excel('./Data/lapi1118_0.xlsx')

In [44]:
df_3.head()

,"Table 1. Per Capita Personal Income by County, 2015 - 2017",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,Per capita personal income1,NaN,NaN,NaN,Percent change from preceding period,NaN,NaN
1,NaN,Dollars,NaN,NaN,Rank in State,Percent change,NaN,Rank in State
2,NaN,2015,2016.0,2017.0,2017,2016,2017.0,2017
3,United States,48940,49831.0,51640.0,--,1.8,3.6,--
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [43]:
df_3.shape

(3223, 8)